elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>IDR</name>
                    <displayName>IDR</displayName>
                    <description>GPIO port input data register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDR15</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR14</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR13</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR12</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR11</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR10</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR9</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR8</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR7</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR6</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR5</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR4</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR3</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR2</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR1</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDR0</name>
                            <description>Port input data (y = 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODR</name>
                    <displayName>ODR</displayName>
                    <description>GPIO port output data register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ODR15</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR14</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR13</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR12</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR11</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR10</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR9</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR8</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR7</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR6</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR5</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR4</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR3</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR2</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR1</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ODR0</name>
                            <description>Port output data (y = 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BSRR</name>
                    <displayName>BSRR</displayName>
                    <description>GPIO port bit set/reset register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BR15</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR14</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR13</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR12</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR11</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR10</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR9</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR8</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR7</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR6</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR5</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR4</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR3</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR2</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR1</name>
                            <description>Port x reset bit y (y = 0..15)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR0</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS15</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS14</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS13</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS12</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS11</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS10</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS9</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS8</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS7</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS6</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS5</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS4</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS3</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS2</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS1</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BS0</name>
                            <description>Port x set bit y (y= 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
