elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>LCKR</name>
                    <displayName>LCKR</displayName>
                    <description>GPIO port configuration lock register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LCKK</name>
                            <description>Lok Key</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK15</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK14</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK13</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK12</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK11</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK10</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK9</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK8</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK7</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK6</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK5</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK4</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK3</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK2</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK1</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCK0</name>
                            <description>Port x lock bit y (y= 0..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFRL</name>
                    <displayName>AFRL</displayName>
                    <description>GPIO alternate function low register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AFRL7</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL6</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL5</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL4</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL3</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL2</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL1</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRL0</name>
                            <description>Alternate function selection for port x bit y (y = 0..7)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFRH</name>
                    <displayName>AFRH</displayName>
                    <description>GPIO alternate function high register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AFRH15</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH14</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH13</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH12</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH11</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH10</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH9</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFRH8</name>
                            <description>Alternate function selection for port x bit y (y = 8..15)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BRR</name>
                    <displayName>BRR</displayName>
                    <description>Port bit reset register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BR0</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR1</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR2</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR3</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR4</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR5</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR6</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR7</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR8</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR9</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR10</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR11</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR12</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR13</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR14</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BR15</name>
                            <description>Port x Reset bit y</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
