elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>IOASCR</name>
                    <displayName>IOASCR</displayName>
                    <description>I/O analog switch control register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>G1_IO1</name>
                            <description>G1_IO1 analog switch enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO2</name>
                            <description>G1_IO2 analog switch enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO3</name>
                            <description>G1_IO3 analog switch enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO4</name>
                            <description>G1_IO4 analog switch enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO1</name>
                            <description>G2_IO1 analog switch enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO2</name>
                            <description>G2_IO2 analog switch enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO3</name>
                            <description>G2_IO3 analog switch enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO4</name>
                            <description>G2_IO4 analog switch enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO1</name>
                            <description>G3_IO1 analog switch enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO2</name>
                            <description>G3_IO2 analog switch enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO3</name>
                            <description>G3_IO3 analog switch enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO4</name>
                            <description>G3_IO4 analog switch enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO1</name>
                            <description>G4_IO1 analog switch enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO2</name>
                            <description>G4_IO2 analog switch enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO3</name>
                            <description>G4_IO3 analog switch enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO4</name>
                            <description>G4_IO4 analog switch enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO1</name>
                            <description>G5_IO1 analog switch enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO2</name>
                            <description>G5_IO2 analog switch enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO3</name>
                            <description>G5_IO3 analog switch enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO4</name>
                            <description>G5_IO4 analog switch enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO1</name>
                            <description>G6_IO1 analog switch enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO2</name>
                            <description>G6_IO2 analog switch enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO3</name>
                            <description>G6_IO3 analog switch enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO4</name>
                            <description>G6_IO4 analog switch enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO1</name>
                            <description>G7_IO1 analog switch enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO2</name>
                            <description>G7_IO2 analog switch enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO3</name>
                            <description>G7_IO3 analog switch enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO4</name>
                            <description>G7_IO4 analog switch enable</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO1</name>
                            <description>G8_IO1 analog switch enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO2</name>
                            <description>G8_IO2 analog switch enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO3</name>
                            <description>G8_IO3 analog switch enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO4</name>
                            <description>G8_IO4 analog switch enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOSCR</name>
                    <displayName>IOSCR</displayName>
                    <description>I/O sampling control register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>G1_IO1</name>
                            <description>G1_IO1 sampling mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO2</name>
                            <description>G1_IO2 sampling mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO3</name>
                            <description>G1_IO3 sampling mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1_IO4</name>
                            <description>G1_IO4 sampling mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO1</name>
                            <description>G2_IO1 sampling mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO2</name>
                            <description>G2_IO2 sampling mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO3</name>
                            <description>G2_IO3 sampling mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2_IO4</name>
                            <description>G2_IO4 sampling mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO1</name>
                            <description>G3_IO1 sampling mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO2</name>
                            <description>G3_IO2 sampling mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO3</name>
                            <description>G3_IO3 sampling mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3_IO4</name>
                            <description>G3_IO4 sampling mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO1</name>
                            <description>G4_IO1 sampling mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO2</name>
                            <description>G4_IO2 sampling mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO3</name>
                            <description>G4_IO3 sampling mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4_IO4</name>
                            <description>G4_IO4 sampling mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO1</name>
                            <description>G5_IO1 sampling mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO2</name>
                            <description>G5_IO2 sampling mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO3</name>
                            <description>G5_IO3 sampling mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5_IO4</name>
                            <description>G5_IO4 sampling mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO1</name>
                            <description>G6_IO1 sampling mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO2</name>
                            <description>G6_IO2 sampling mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO3</name>
                            <description>G6_IO3 sampling mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6_IO4</name>
                            <description>G6_IO4 sampling mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO1</name>
                            <description>G7_IO1 sampling mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO2</name>
                            <description>G7_IO2 sampling mode</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO3</name>
                            <description>G7_IO3 sampling mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G7_IO4</name>
                            <description>G7_IO4 sampling mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO1</name>
                            <description>G8_IO1 sampling mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO2</name>
                            <description>G8_IO2 sampling mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO3</name>
                            <description>G8_IO3 sampling mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G8_IO4</name>
                            <description>G8_IO4 sampling mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
