elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>CSR</name>
                    <displayName>CSR</displayName>
                    <description>Control/status register (RCC_CSR)</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0C000000</resetValue>
                    <fields>
                        <field>
                            <name>LSION</name>
                            <description>Internal low speed oscillator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSIRDY</name>
                            <description>Internal low speed oscillator ready</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMVF</name>
                            <description>Remove reset flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OBLRSTF</name>
                            <description>Option byte loader reset flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINRSTF</name>
                            <description>PIN reset flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORRSTF</name>
                            <description>POR/PDR reset flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SFTRSTF</name>
                            <description>Software reset flag</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IWDGRSTF</name>
                            <description>Independent watchdog reset flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WWDGRSTF</name>
                            <description>Window watchdog reset flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPWRRSTF</name>
                            <description>Low-power reset flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHBRSTR</name>
                    <displayName>AHBRSTR</displayName>
                    <description>AHB peripheral reset register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IOPARST</name>
                            <description>I/O port A reset</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBRST</name>
                            <description>I/O port B reset</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPCRST</name>
                            <description>I/O port C reset</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPDRST</name>
                            <description>I/O port D reset</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPERST</name>
                            <description>I/O port E reset</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPFRST</name>
                            <description>I/O port F reset</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSCRST</name>
                            <description>Touch sensing controller reset</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC12RST</name>
                            <description>ADC1 and ADC2 reset</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC34RST</name>
                            <description>ADC3 and ADC4 reset</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFGR2</name>
                    <displayName>CFGR2</displayName>
                    <description>Clock configuration register 2</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PREDIV</name>
                            <description>PREDIV division factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC12PRES</name>
                            <description>ADC1 and ADC2 prescaler</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADC34PRES</name>
                            <description>ADC3 and ADC4 prescaler</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFGR3</name>
                    <displayName>CFGR3</displayName>
                    <description>Clock configuration register 3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>USART1SW</name>
                            <description>USART1 clock source selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2C1SW</name>
                            <description>I2C1 clock source selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2SW</name>
                            <description>I2C2 clock source selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART2SW</name>
                            <description>USART2 clock source selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>USART3SW</name>
                            <description>USART3 clock source selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIM1SW</name>
                            <description>Timer1 clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM8SW</name>
                            <description>Timer8 clock source selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4SW</name>
                            <description>UART4 clock source selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UART5SW</name>
                            <description>UART5 clock source selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
