elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIM2">
            <name>TIM3</name>
            <baseAddress>0x40000400</baseAddress>
            <interrupt>
                <name>TIM3</name>
                <description>TIM3 global interrupt</description>
                <value>29</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TIM2">
            <name>TIM4</name>
            <baseAddress>0x40000800</baseAddress>
            <interrupt>
                <name>TIM4</name>
                <description>TIM4 global interrupt</description>
                <value>30</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TIM15</name>
            <description>General purpose timers</description>
            <groupName>TIMs</groupName>
            <baseAddress>0x40014000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIM1_BRK_TIM15</name>
                <description>TIM1 Break/TIM15 global
                    interruts
                </description>
                <value>24</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR1</name>
                    <displayName>CR1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CEN</name>
                            <description>Counter enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDIS</name>
                            <description>Update disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>URS</name>
                            <description>Update request source</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPM</name>
                            <description>One-pulse mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARPE</name>
                            <description>Auto-reload preload enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CKD</name>
                            <description>Clock division</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UIFREMAP</name>
                            <description>UIF status bit remapping</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <displayName>CR2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CCPC</name>
                            <description>Capture/compare preloaded control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCUS</name>
                            <description>Capture/compare control update selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCDS</name>
                            <description>Capture/compare DMA selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMS</name>
                            <description>Master mode selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TI1S</name>
                            <description>TI1 selection</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OIS1</name>
                            <description>Output Idle state 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OIS1N</name>
                            <description>Output Idle state 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OIS2</name>
                            <description>Output Idle state 2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMCR</name>
                    <displayName>SMCR</displayName>
                    <description>slave mode control register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>SMS</name>
                            <description>Slave mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TS</name>
                            <description>Trigger selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSM</name>
                            <description>Master/Slave mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMS_3</name>
                            <description>Slave mode selection bit 3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIER</name>
                    <displayName>DIER</displayName>
                    <description>DMA/Interrupt enable register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>UIE</name>
                            <description>Update interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1IE</name>
                            <description>Capture/Compare 1 interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2IE</name>
                            <description>Capture/Compare 2 interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMIE</name>
                            <description>COM interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIE</name>
                            <description>Trigger interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIE</name>
                            <description>Break interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDE</name>
                            <description>Update DMA request enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1DE</name>
                            <description>Capture/Compare 1 DMA request enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2DE</name>
                            <description>Capture/Compare 2 DMA request enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMDE</name>
                            <description>COM DMA request enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TDE</name>
                            <description>Trigger DMA request enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CC2OF</name>
                            <description>Capture/compare 2 overcapture flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1OF</name>
                            <description>Capture/Compare 1 overcapture flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIF</name>
                            <description>Break interrupt flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIF</name>
                            <description>Trigger interrupt flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMIF</name>
                            <description>COM interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2IF</name>
                            <description>Capture/Compare 2 interrupt flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1IF</name>
                            <description>Capture/compare 1 interrupt flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UIF</name>
                            <description>Update interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EGR</name>
                    <displayName>EGR</displayName>
                    <description>event generation register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>BG</name>
                            <description>Break generation</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TG</name>
                            <description>Trigger generation</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMG</name>
                            <description>Capture/Compare control update generation</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2G</name>
                            <description>Capture/compare 2 generation</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1G</name>
                            <description>Capture/compare 1 generation</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UG</name>
                            <description>Update generation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCMR1_Output</name>
                    <displayName>CCMR1_Output</displayName>
                    <description>capture/compare mode register (output mode)</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC1S</name>
                            <description>Capture/Compare 1 selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC1FE</name>
                            <description>Output Compare 1 fast enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1PE</name>
                            <description>Output Compare 1 preload enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1M</name>
                            <description>Output Compare 1 mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CC2S</name>
                            <description>Capture/Compare 2 selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC2FE</name>
                            <description>Output Compare 2 fast enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2PE</name>
                            <description>Output Compare 2 preload enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2M</name>
                            <description>Output Compare 2 mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OC1M_3</name>
                            <description>Output Compare 1 mode bit 3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2M_3</name>
                            <description>Output Compare 2 mode bit 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCMR1_Input</name>
                    <displayName>CCMR1_Input</displayName>
                    <description>capture/compare mode register 1 (input mode)</description>
                    <alternateRegister>CCMR1_Output</alternateRegister>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IC2F</name>
                            <description>Input capture 2 filter</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>IC2PSC</name>
                            <description>Input capture 2 prescaler</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CC2S</name>
                            <description>Capture/Compare 2 selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>IC1F</name>
                            <description>Input capture 1 filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>IC1PSC</name>
                            <description>Input capture 1 prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CC1S</name>
                            <description>Capture/Compare 1 selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
