elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>COMP6_CSR</name>
                    <displayName>COMP6_CSR</displayName>
                    <description>control and status register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COMP6EN</name>
                            <description>Comparator 6 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6MODE</name>
                            <description>Comparator 6 mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6INSEL</name>
                            <description>Comparator 6 inverting input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6INPSEL</name>
                            <description>Comparator 6 non inverted input selection</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COM6WINMODE</name>
                            <description>Comparator 6 window mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6_OUT_SEL</name>
                            <description>Comparator 6 output selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6POL</name>
                            <description>Comparator 6 output polarity</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6HYST</name>
                            <description>Comparator 6 hysteresis</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6_BLANKING</name>
                            <description>Comparator 6 blanking source</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP6OUT</name>
                            <description>Comparator 6 output</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>COMP6LOCK</name>
                            <description>Comparator 6 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP7_CSR</name>
                    <displayName>COMP7_CSR</displayName>
                    <description>control and status register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COMP7EN</name>
                            <description>Comparator 7 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7MODE</name>
                            <description>Comparator 7 mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7INSEL</name>
                            <description>Comparator 7 inverting input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7INPSEL</name>
                            <description>Comparator 7 non inverted input selection</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7_OUT_SEL</name>
                            <description>Comparator 7 output selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7POL</name>
                            <description>Comparator 7 output polarity</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7HYST</name>
                            <description>Comparator 7 hysteresis</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7_BLANKING</name>
                            <description>Comparator 7 blanking source</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMP7OUT</name>
                            <description>Comparator 7 output</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>COMP7LOCK</name>
                            <description>Comparator 7 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
