elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>RF1R</name>
                    <displayName>RF1R</displayName>
                    <description>receive FIFO 1 register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFOM1</name>
                            <description>RFOM1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOVR1</name>
                            <description>FOVR1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FULL1</name>
                            <description>FULL1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMP1</name>
                            <description>FMP1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IER</name>
                    <displayName>IER</displayName>
                    <description>interrupt enable register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLKIE</name>
                            <description>SLKIE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUIE</name>
                            <description>WKUIE</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>ERRIE</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LECIE</name>
                            <description>LECIE</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOFIE</name>
                            <description>BOFIE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPVIE</name>
                            <description>EPVIE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EWGIE</name>
                            <description>EWGIE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVIE1</name>
                            <description>FOVIE1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFIE1</name>
                            <description>FFIE1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMPIE1</name>
                            <description>FMPIE1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVIE0</name>
                            <description>FOVIE0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FFIE0</name>
                            <description>FFIE0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMPIE0</name>
                            <description>FMPIE0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMEIE</name>
                            <description>TMEIE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ESR</name>
                    <displayName>ESR</displayName>
                    <description>error status register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REC</name>
                            <description>REC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEC</name>
                            <description>TEC</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LEC</name>
                            <description>LEC</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOFF</name>
                            <description>BOFF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPVF</name>
                            <description>EPVF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EWGF</name>
                            <description>EWGF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BTR</name>
                    <displayName>BTR</displayName>
                    <description>bit timing register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x01230000</resetValue>
                    <fields>
                        <field>
                            <name>SILM</name>
                            <description>SILM</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LBKM</name>
                            <description>LBKM</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SJW</name>
                            <description>SJW</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TS2</name>
                            <description>TS2</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TS1</name>
                            <description>TS1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BRP</name>
                            <description>BRP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TI0R</name>
                    <displayName>TI0R</displayName>
                    <description>TX mailbox identifier register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STID</name>
                            <description>STID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXID</name>
                            <description>EXID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRQ</name>
                            <description>TXRQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDT0R</name>
                    <displayName>TDT0R</displayName>
                    <description>mailbox data length control and time stamp register</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIME</name>
                            <description>TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TGT</name>
                            <description>TGT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>DLC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDL0R</name>
                    <displayName>TDL0R</displayName>
                    <description>mailbox data low register</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>DATA3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>DATA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDH0R</name>
                    <displayName>TDH0R</displayName>
                    <description>mailbox data high register</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>DATA7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>DATA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>DATA5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA4</name>
                            <description>DATA4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TI1R</name>
                    <displayName>TI1R</displayName>
                    <description>TX mailbox identifier register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STID</name>
                            <description>STID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXID</name>
                            <description>EXID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRQ</name>
                            <description>TXRQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDT1R</name>
                    <displayName>TDT1R</displayName>
                    <description>mailbox data length control and time stamp register</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIME</name>
                            <description>TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TGT</name>
                            <description>TGT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>DLC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDL1R</name>
                    <displayName>TDL1R</displayName>
                    <description>mailbox data low register</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>DATA3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>DATA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDH1R</name>
                    <displayName>TDH1R</displayName>
                    <description>mailbox data high register</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>DATA7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>DATA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>DATA5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA4</name>
                            <description>DATA4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
