elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>TI2R</name>
                    <displayName>TI2R</displayName>
                    <description>TX mailbox identifier register</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STID</name>
                            <description>STID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXID</name>
                            <description>EXID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRQ</name>
                            <description>TXRQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDT2R</name>
                    <displayName>TDT2R</displayName>
                    <description>mailbox data length control and time stamp register</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIME</name>
                            <description>TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>TGT</name>
                            <description>TGT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>DLC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDL2R</name>
                    <displayName>TDL2R</displayName>
                    <description>mailbox data low register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>DATA3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>DATA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDH2R</name>
                    <displayName>TDH2R</displayName>
                    <description>mailbox data high register</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>DATA7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>DATA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>DATA5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA4</name>
                            <description>DATA4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RI0R</name>
                    <displayName>RI0R</displayName>
                    <description>receive FIFO mailbox identifier register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STID</name>
                            <description>STID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXID</name>
                            <description>EXID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDT0R</name>
                    <displayName>RDT0R</displayName>
                    <description>receive FIFO mailbox data length control and time stamp register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIME</name>
                            <description>TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FMI</name>
                            <description>FMI</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>DLC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDL0R</name>
                    <displayName>RDL0R</displayName>
                    <description>receive FIFO mailbox data low register</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>DATA3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>DATA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDH0R</name>
                    <displayName>RDH0R</displayName>
                    <description>receive FIFO mailbox data high register</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>DATA7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>DATA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>DATA5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA4</name>
                            <description>DATA4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RI1R</name>
                    <displayName>RI1R</displayName>
                    <description>receive FIFO mailbox identifier register</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STID</name>
                            <description>STID</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXID</name>
                            <description>EXID</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDE</name>
                            <description>IDE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>RTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDT1R</name>
                    <displayName>RDT1R</displayName>
                    <description>receive FIFO mailbox data length control and time stamp register</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIME</name>
                            <description>TIME</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FMI</name>
                            <description>FMI</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>DLC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDL1R</name>
                    <displayName>RDL1R</displayName>
                    <description>receive FIFO mailbox data low register</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>DATA3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>DATA2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDH1R</name>
                    <displayName>RDH1R</displayName>
                    <description>receive FIFO mailbox data high register</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>DATA7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>DATA6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>DATA5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA4</name>
                            <description>DATA4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMR</name>
                    <displayName>FMR</displayName>
                    <description>filter master register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x2A1C0E01</resetValue>
                    <fields>
                        <field>
                            <name>CAN2SB</name>
                            <description>CAN2 start bank</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>FINIT</name>
                            <description>Filter init mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
