elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2_EV_EXTI24</name>
                <description>I2C2 event interrupt &amp; EXTI Line24
                    interrupt
                </description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>I2C2_ER</name>
                <description>I2C2 error interrupt</description>
                <value>34</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C3</name>
            <baseAddress>0x40007800</baseAddress>
            <interrupt>
                <name>I2C2_EV_EXTI24</name>
                <description>I2C2 event interrupt &amp; EXTI Line24
                    interrupt
                </description>
                <value>33</value>
            </interrupt>
            <interrupt>
                <name>I2C2_ER</name>
                <description>I2C2 error interrupt</description>
                <value>34</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>IWDG</name>
            <description>Independent watchdog</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KR</name>
                    <displayName>KR</displayName>
                    <description>Key register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Key value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <displayName>PR</displayName>
                    <description>Prescaler register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PR</name>
                            <description>Prescaler divider</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLR</name>
                    <displayName>RLR</displayName>
                    <description>Reload register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>RL</name>
                            <description>Watchdog counter reload value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>Status register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>Watchdog prescaler value update</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RVU</name>
                            <description>Watchdog counter reload value update</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WVU</name>
                            <description>Watchdog counter window value update</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WINR</name>
                    <displayName>WINR</displayName>
                    <description>Window register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>WIN</name>
                            <description>Watchdog counter window value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>WWDG</name>
            <description>Window watchdog</description>
            <groupName>WWDG</groupName>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDG</name>
                <description>Window Watchdog interrupt</description>
                <value>0</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>T</name>
                            <description>7-bit counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>WDGA</name>
                            <description>Activation bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFR</name>
                    <displayName>CFR</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>EWI</name>
                            <description>Early wakeup interrupt</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDGTB</name>
                            <description>Timer base</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>W</name>
                            <description>7-bit window value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>Status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EWIF</name>
                            <description>Early wakeup interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
