elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Real-time clock</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40002800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC_WKUP</name>
                <description>RTC Wakeup interrupt through the EXTI
                    line
                </description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>RTCAlarm</name>
                <description>RTC alarm interrupt</description>
                <value>41</value>
            </interrupt>
            <registers>
                <register>
                    <name>TR</name>
                    <displayName>TR</displayName>
                    <description>time register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PM</name>
                            <description>AM/PM notation</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HT</name>
                            <description>Hour tens in BCD format</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>HU</name>
                            <description>Hour units in BCD format</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MNT</name>
                            <description>Minute tens in BCD format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MNU</name>
                            <description>Minute units in BCD format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>Second tens in BCD format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SU</name>
                            <description>Second units in BCD format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR</name>
                    <displayName>DR</displayName>
                    <description>date register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00002101</resetValue>
                    <fields>
                        <field>
                            <name>YT</name>
                            <description>Year tens in BCD format</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>YU</name>
                            <description>Year units in BCD format</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>WDU</name>
                            <description>Week day units</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MT</name>
                            <description>Month tens in BCD format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MU</name>
                            <description>Month units in BCD format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DT</name>
                            <description>Date tens in BCD format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DU</name>
                            <description>Date units in BCD format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>control register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WCKSEL</name>
                            <description>Wakeup clock selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TSEDGE</name>
                            <description>Time-stamp event active edge</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REFCKON</name>
                            <description>Reference clock detection enable (50 or 60 Hz)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BYPSHAD</name>
                            <description>Bypass the shadow registers</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMT</name>
                            <description>Hour format</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAE</name>
                            <description>Alarm A enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBE</name>
                            <description>Alarm B enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTE</name>
                            <description>Wakeup timer enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSE</name>
                            <description>Time stamp enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAIE</name>
                            <description>Alarm A interrupt enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBIE</name>
                            <description>Alarm B interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTIE</name>
                            <description>Wakeup timer interrupt enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSIE</name>
                            <description>Time-stamp interrupt enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADD1H</name>
                            <description>Add 1 hour (summer time change)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SUB1H</name>
                            <description>Subtract 1 hour (winter time change)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BKP</name>
                            <description>Backup</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COSEL</name>
                            <description>Calibration output selection</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>Output polarity</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>Output selection</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>COE</name>
                            <description>Calibration output enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISR</name>
                    <displayName>ISR</displayName>
                    <description>initialization and status register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <field>
                            <name>ALRAWF</name>
                            <description>Alarm A write flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALRBWF</name>
                            <description>Alarm B write flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WUTWF</name>
                            <description>Wakeup timer write flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SHPF</name>
                            <description>Shift operation pending</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INITS</name>
                            <description>Initialization status flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSF</name>
                            <description>Registers synchronization flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INITF</name>
                            <description>Initialization flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INIT</name>
                            <description>Initialization mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALRAF</name>
                            <description>Alarm A flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALRBF</name>
                            <description>Alarm B flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUTF</name>
                            <description>Wakeup timer flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSF</name>
                            <description>Time-stamp flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSOVF</name>
                            <description>Time-stamp overflow flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAMP1F</name>
                            <description>Tamper detection flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAMP2F</name>
                            <description>RTC_TAMP2 detection flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAMP3F</name>
                            <description>RTC_TAMP3 detection flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RECALPF</name>
                            <description>Recalibration pending Flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRER</name>
                    <displayName>PRER</displayName>
                    <description>prescaler register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x007F00FF</resetValue>
                    <fields>
                        <field>
                            <name>PREDIV_A</name>
                            <description>Asynchronous prescaler factor</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>PREDIV_S</name>
                            <description>Synchronous prescaler factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WUTR</name>
                    <displayName>WUTR</displayName>
                    <description>wakeup timer register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>WUT</name>
                            <description>Wakeup auto-reload value bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
