elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>TAFCR</name>
                    <displayName>TAFCR</displayName>
                    <description>tamper and alternate function configuration register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TAMP1E</name>
                            <description>Tamper 1 detection enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP1TRG</name>
                            <description>Active level for tamper 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPIE</name>
                            <description>Tamper interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP2E</name>
                            <description>Tamper 2 detection enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP2TRG</name>
                            <description>Active level for tamper 2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP3E</name>
                            <description>Tamper 3 detection enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP3TRG</name>
                            <description>Active level for tamper 3</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPTS</name>
                            <description>Activate timestamp on tamper detection event</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMPFREQ</name>
                            <description>Tamper sampling frequency</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TAMPFLT</name>
                            <description>Tamper filter count</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TAMPPRCH</name>
                            <description>Tamper precharge duration</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TAMPPUDIS</name>
                            <description>TAMPER pull-up disable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC13VALUE</name>
                            <description>PC13 value</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC13MODE</name>
                            <description>PC13 mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC14VALUE</name>
                            <description>PC14 value</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC14MODE</name>
                            <description>PC 14 mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC15VALUE</name>
                            <description>PC15 value</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC15MODE</name>
                            <description>PC15 mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRMASSR</name>
                    <displayName>ALRMASSR</displayName>
                    <description>alarm A sub second register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MASKSS</name>
                            <description>Mask the most-significant bits starting at this bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SS</name>
                            <description>Sub seconds value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRMBSSR</name>
                    <displayName>ALRMBSSR</displayName>
                    <description>alarm B sub second register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MASKSS</name>
                            <description>Mask the most-significant bits starting at this bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SS</name>
                            <description>Sub seconds value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP0R</name>
                    <displayName>BKP0R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP1R</name>
                    <displayName>BKP1R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP2R</name>
                    <displayName>BKP2R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP3R</name>
                    <displayName>BKP3R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP4R</name>
                    <displayName>BKP4R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP5R</name>
                    <displayName>BKP5R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP6R</name>
                    <displayName>BKP6R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP7R</name>
                    <displayName>BKP7R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP8R</name>
                    <displayName>BKP8R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP9R</name>
                    <displayName>BKP9R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP10R</name>
                    <displayName>BKP10R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP11R</name>
                    <displayName>BKP11R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP12R</name>
                    <displayName>BKP12R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP13R</name>
                    <displayName>BKP13R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP14R</name>
                    <displayName>BKP14R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP15R</name>
                    <displayName>BKP15R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP16R</name>
                    <displayName>BKP16R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP17R</name>
                    <displayName>BKP17R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP18R</name>
                    <displayName>BKP18R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP19R</name>
                    <displayName>BKP19R</displayName>
                    <description>backup register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP20R</name>
                    <displayName>BKP20R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
