elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
                <register>
                    <name>BKP21R</name>
                    <displayName>BKP21R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP22R</name>
                    <displayName>BKP22R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP23R</name>
                    <displayName>BKP23R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP24R</name>
                    <displayName>BKP24R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP25R</name>
                    <displayName>BKP25R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP26R</name>
                    <displayName>BKP26R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP27R</name>
                    <displayName>BKP27R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP28R</name>
                    <displayName>BKP28R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP29R</name>
                    <displayName>BKP29R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP30R</name>
                    <displayName>BKP30R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKP31R</name>
                    <displayName>BKP31R</displayName>
                    <description>backup register</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
