elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>FPU</name>
            <description>Floting point unit</description>
            <groupName>FPU</groupName>
            <baseAddress>0xE000ED88</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x200</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FPU</name>
                <description>Floating point interrupt</description>
                <value>81</value>
            </interrupt>
            <registers>
                <register>
                    <name>CPACR</name>
                    <displayName>CPACR</displayName>
                    <description>Coprocessor Access Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CP0</name>
                            <description>Access privileges for coprocessor 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP1</name>
                            <description>Access privileges for coprocessor 1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP2</name>
                            <description>Access privileges for coprocessor 2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP3</name>
                            <description>Access privileges for coprocessor 3</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP4</name>
                            <description>Access privileges for coprocessor 4</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP5</name>
                            <description>Access privileges for coprocessor 5</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP6</name>
                            <description>Access privileges for coprocessor 6</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CP7</name>
                            <description>Access privileges for coprocessor 7</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP10</name>
                            <description>Access privileges for coprocessor 10</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP11</name>
                            <description>Access privileges for coprocessor 11</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPCCR</name>
                    <displayName>FPCCR</displayName>
                    <description>FP Context Control Register</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xC0000000</resetValue>
                    <fields>
                        <field>
                            <name>LSPACT</name>
                            <description>LSPACT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USER</name>
                            <description>USER</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THREAD</name>
                            <description>THREAD</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HFRDY</name>
                            <description>HFRDY</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMRDY</name>
                            <description>MMRDY</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BFRDY</name>
                            <description>BFRDY</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MONRDY</name>
                            <description>MONRDY</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSPEN</name>
                            <description>LSPEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ASPEN</name>
                            <description>ASPEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPCAR</name>
                    <displayName>FPCAR</displayName>
                    <description>FP Context Address Register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDRESS</name>
                            <description>ADDRESS</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPDSCR</name>
                    <displayName>FPDSCR</displayName>
                    <description>FP Default Status Control Register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RMode</name>
                            <description>RMode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FZ</name>
                            <description>FZ</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DN</name>
                            <description>DN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHP</name>
                            <description>AHP</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MVFR0</name>
                    <displayName>MVFR0</displayName>
                    <description>Media and VFP Feature Register 0</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x10110021</resetValue>
                    <fields>
                        <field>
                            <name>A_SIMD</name>
                            <description>A_SIMD registers</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Single_precision</name>
                            <description>Single_precision</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Double_precision</name>
                            <description>Double_precision</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FP_exception_trapping</name>
                            <description>FP exception trapping</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Divide</name>
                            <description>Divide</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Square_root</name>
                            <description>Square root</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Short_vectors</name>
                            <description>Short vectors</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FP_rounding_modes</name>
                            <description>FP rounding modes</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MVFR1</name>
                    <displayName>MVFR1</displayName>
                    <description>Media and VFP Feature Register 1</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x11000011</resetValue>
                    <fields>
                        <field>
                            <name>FtZ_mode</name>
                            <description>FtZ mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>D_NaN_mode</name>
                            <description>D_NaN mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FP_HPFP</name>
                            <description>FP HPFP</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FP_fused_MAC</name>
                            <description>FP fused MAC</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
