elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>DBGMCU</name>
            <description>Debug support</description>
            <groupName>DBGMCU</groupName>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IDCODE</name>
                    <displayName>IDCODE</displayName>
                    <description>MCU Device ID Code Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DEV_ID</name>
                            <description>Device Identifier</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>REV_ID</name>
                            <description>Revision Identifier</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>Debug MCU Configuration Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DBG_SLEEP</name>
                            <description>Debug Sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_STOP</name>
                            <description>Debug Stop Mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_STANDBY</name>
                            <description>Debug Standby Mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRACE_IOEN</name>
                            <description>Trace pin assignment control</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRACE_MODE</name>
                            <description>Trace pin assignment control</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB1FZ</name>
                    <displayName>APB1FZ</displayName>
                    <description>APB Low Freeze Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DBG_TIM2_STOP</name>
                            <description>Debug Timer 2 stopped when Core is halted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM3_STOP</name>
                            <description>Debug Timer 3 stopped when Core is halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM4_STOP</name>
                            <description>Debug Timer 4 stopped when Core is halted</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM5_STOP</name>
                            <description>Debug Timer 5 stopped when Core is halted</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM6_STOP</name>
                            <description>Debug Timer 6 stopped when Core is halted</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM7_STOP</name>
                            <description>Debug Timer 7 stopped when Core is halted</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM12_STOP</name>
                            <description>Debug Timer 12 stopped when Core is halted</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM13_STOP</name>
                            <description>Debug Timer 13 stopped when Core is halted</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIMER14_STOP</name>
                            <description>Debug Timer 14 stopped when Core is halted</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM18_STOP</name>
                            <description>Debug Timer 18 stopped when Core is halted</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_RTC_STOP</name>
                            <description>Debug RTC stopped when Core is halted</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_WWDG_STOP</name>
                            <description>Debug Window Wachdog stopped when Core is halted</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_IWDG_STOP</name>
                            <description>Debug Independent Wachdog stopped when Core is halted</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1_SMBUS_TIMEOUT</name>
                            <description>SMBUS timeout mode stopped when Core is halted</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2_SMBUS_TIMEOUT</name>
                            <description>SMBUS timeout mode stopped when Core is halted</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_CAN_STOP</name>
                            <description>Debug CAN stopped when core is halted</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2FZ</name>
                    <displayName>APB2FZ</displayName>
                    <description>APB High Freeze Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DBG_TIM15_STOP</name>
                            <description>Debug Timer 15 stopped when Core is halted</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM16_STOP</name>
                            <description>Debug Timer 16 stopped when Core is halted</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM17_STO</name>
                            <description>Debug Timer 17 stopped when Core is halted</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBG_TIM19_STOP</name>
                            <description>Debug Timer 19 stopped when Core is halted</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
