elmot/open-oscilloscope-stm32f3/client/src/main/resources/xyz/elmot/gencfile/STM32F303xE.svd.xml
            </registers>
        </peripheral>
        <peripheral>
            <name>OPAMP</name>
            <description>Operational amplifier</description>
            <groupName>OPAMP</groupName>
            <baseAddress>0x40010038</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3C8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>OPAMP1_CR</name>
                    <displayName>OPAMP1_CR</displayName>
                    <description>OPAMP1 control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OPAMP1_EN</name>
                            <description>OPAMP1 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCE_VP</name>
                            <description>FORCE_VP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP_SEL</name>
                            <description>OPAMP1 Non inverting input selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VM_SEL</name>
                            <description>OPAMP1 inverting input selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCM_EN</name>
                            <description>Timer controlled Mux mode enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VMS_SEL</name>
                            <description>OPAMP1 inverting input secondary selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VPS_SEL</name>
                            <description>OPAMP1 Non inverting input secondary selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALON</name>
                            <description>Calibration mode enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALSEL</name>
                            <description>Calibration selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGA_GAIN</name>
                            <description>Gain in PGA mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USER_TRIM</name>
                            <description>User trimming enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETP</name>
                            <description>Offset trimming value (PMOS)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETN</name>
                            <description>Offset trimming value (NMOS)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSTREF</name>
                            <description>TSTREF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTCAL</name>
                            <description>OPAMP 1 ouput status flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>OPAMP 1 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OPAMP2_CR</name>
                    <displayName>OPAMP2_CR</displayName>
                    <description>OPAMP2 control register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OPAMP2EN</name>
                            <description>OPAMP2 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCE_VP</name>
                            <description>FORCE_VP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP_SEL</name>
                            <description>OPAMP2 Non inverting input selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VM_SEL</name>
                            <description>OPAMP2 inverting input selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCM_EN</name>
                            <description>Timer controlled Mux mode enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VMS_SEL</name>
                            <description>OPAMP2 inverting input secondary selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VPS_SEL</name>
                            <description>OPAMP2 Non inverting input secondary selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALON</name>
                            <description>Calibration mode enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAL_SEL</name>
                            <description>Calibration selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGA_GAIN</name>
                            <description>Gain in PGA mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USER_TRIM</name>
                            <description>User trimming enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETP</name>
                            <description>Offset trimming value (PMOS)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETN</name>
                            <description>Offset trimming value (NMOS)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSTREF</name>
                            <description>TSTREF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTCAL</name>
                            <description>OPAMP 2 ouput status flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>OPAMP 2 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OPAMP3_CR</name>
                    <displayName>OPAMP3_CR</displayName>
                    <description>OPAMP3 control register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OPAMP3EN</name>
                            <description>OPAMP3 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCE_VP</name>
                            <description>FORCE_VP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP_SEL</name>
                            <description>OPAMP3 Non inverting input selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VM_SEL</name>
                            <description>OPAMP3 inverting input selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCM_EN</name>
                            <description>Timer controlled Mux mode enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VMS_SEL</name>
                            <description>OPAMP3 inverting input secondary selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VPS_SEL</name>
                            <description>OPAMP3 Non inverting input secondary selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALON</name>
                            <description>Calibration mode enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALSEL</name>
                            <description>Calibration selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGA_GAIN</name>
                            <description>Gain in PGA mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USER_TRIM</name>
                            <description>User trimming enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETP</name>
                            <description>Offset trimming value (PMOS)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIMOFFSETN</name>
                            <description>Offset trimming value (NMOS)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSTREF</name>
                            <description>TSTREF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTCAL</name>
                            <description>OPAMP 3 ouput status flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>OPAMP 3 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
